Repository: 2sic-forks/dnn.azureadb2cprovider
Catalog: DotNetNuke.Authentication.Azure.B2C/admin/personaBar/App_LocalResources/AzureADB2C.*.resx
Languages: de_de

# No.Text
source: No
de_de: Nein

# SettingsError.Text
source: Could not update the settings. Please try later.
de_de: Die Einstellungen konnten nicht aktualisiert werden. Bitte versuch es später.

# SettingsRestoreWarning.Text
source: Are you sure you want to cancel your changes?
de_de: Möchten Sie Ihre Änderungen wirklich abbrechen?

# SettingsUpdateSuccess.Text
source: The settings have been updated.
de_de: Die Einstellungen wurden aktualisiert.

# Yes.Text
source: Yes
de_de: Ja

# Cancel.Text
source: Cancel
de_de: Stornieren

# lblTenantName.Error
source: You must specify the Azure AD B2C Tenant Name
de_de: Sie müssen den Azure AD B2C-Mandantennamen angeben

# lblTenantName.Help
source: Azure Active Directory B2C tenant name (&lt;TenantName&gt;.onmicrosoft.com). Don't include the ".onmicrosoft.com" part, just the tenant name
de_de: Azure Active Directory B2C-Mandantenname (&lt;TenantName&gt;.onmicrosoft.com). Geben Sie nicht den Teil ".onmicrosoft.com" an, sondern nur den Namen des Mandanten.

# lblTenantId.Text
source: Tenant ID
de_de: Mieter ID

# lblTenantId.Error
source: You must specify the Azure AD B2C Tenant ID
de_de: Sie müssen die Azure AD B2C-Mandanten-ID angeben

# lblTenantId.Help
source: Azure Active Directory B2C tenant ID (Directory ID). You can find it by using the Azure portal, on the properties section of the Azure AD that contains the users
de_de: Azure Active Directory B2C-Mandanten-ID (Verzeichnis-ID). Sie finden es über das Azure-Portal im Eigenschaftenabschnitt von Azure AD, der die Benutzer enthält

# lblAppId.Error
source: You must specify your B2C application ID
de_de: Sie müssen Ihre B2C-Anwendungs-ID angeben

# lblAppId.Help
source: The unique identifier of the Azure AD B2C application
de_de: Der eindeutige Bezeichner der Azure AD B2C-Anwendung

# lblAppSecret.Error
source: You must specify the application secret
de_de: Sie müssen das Anwendungsgeheimnis angeben

# lblAppSecret.Help
source: Azure AD B2C application secret
de_de: Azure AD B2C-Anwendungsgeheimnis

# lblAppSecret.Text
source: Secret
de_de: Geheimnis

# lblAutoRedirect.Help
source: If enabled, the login page will automatically redirect to the Azure AD B2C login page
de_de: Wenn diese Option aktiviert ist, wird die Anmeldeseite automatisch zur Azure AD B2C-Anmeldeseite umgeleitet

# lblAutoRedirect.Text
source: Auto-Redirect
de_de: Automatische Umleitung

# lblEnabled.Help
source: Enables the Azure Active Directory B2C authentication provider for this portal
de_de: Aktiviert den Azure Active Directory-B2C-Authentifizierungsanbieter für dieses Portal

# lblEnabled.Text
source: Enabled
de_de: Aktiviert

# lblDirectory.Text
source: Directory
de_de: Verzeichnis

# lblProviderCredentials.Text
source: Provider credentials
de_de: Anmeldeinformationen des Anbieters

# lblTabDescription.Text
source: The DNN Azure Active Directory B2C Provider is an Authentication provider for DNN Platform that uses Azure Active Directory B2C OAuth2 authentication to authenticate users.
de_de: Der DNN Azure Active Directory-B2C-Anbieter ist ein Authentifizierungsanbieter für DNN Platform, der die Azure Active Directory-B2C-OAuth2-Authentifizierung verwendet, um Benutzer zu authentifizieren.

# SaveSettings.Text
source: Save Settings
de_de: Einstellungen speichern

# lblPasswordResetPolicyName.Error
source: You must specify the name of the policy to reset the password
de_de: Sie müssen den Namen der Richtlinie angeben, um das Kennwort zurückzusetzen

# lblPasswordResetPolicyName.Help
source: The name of the policy to reset the password
de_de: Der Name der Richtlinie zum Zurücksetzen des Kennworts

# lblPasswordResetPolicyName.Text
source: Reset password policy name
de_de: Setzen Sie den Namen der Passwortrichtlinie zurück

# lblPolicies.Text
source: Policies (User flows)
de_de: Richtlinien (Benutzerflüsse)

# lblProfilePolicyName.Error
source: You must specify the name of the profile policy
de_de: Sie müssen den Namen der Profilrichtlinie angeben

# lblProfilePolicyName.Help
source: The name of the policy for the profile
de_de: Der Name der Richtlinie für das Profil

# lblProfilePolicyName.Text
source: Profile policy name
de_de: Name der Profilrichtlinie

# lblSignUpPolicyName.Error
source: You must specify the name of the sign up policy
de_de: Sie müssen den Namen der Registrierungsrichtlinie angeben

# lblSignUpPolicyName.Help
source: The name of the policy for sign up and sign in. If you won't use the signup, just introduce your signin policy name
de_de: Der Name der Richtlinie für die Registrierung und Anmeldung. Wenn Sie die Registrierung nicht verwenden, geben Sie einfach den Namen Ihrer Anmelderichtlinie ein

# lblSignUpPolicyName.Text
source: Sign up and/or sign in policy name
de_de: Registrieren und / oder Anmelden des Richtliniennamens

# lblTenantName.Text
source: Tenant Name
de_de: Name des Mieters

# lblAADAppClientId.Error
source: You must specify the Azure AD Application ID
de_de: Sie müssen die Azure AD-Anwendungs-ID angeben

# lblAADAppClientId.Help
source: The Azure AD Application ID (it's used to sync user data)
de_de: Die Azure AD-Anwendungs-ID (wird zum Synchronisieren von Benutzerdaten verwendet)

# lblAADAppClientId.Text
source: Application Id
de_de: Anwendungs-ID

# lblAADAppSecret.Error
source: You must especify the application key
de_de: Sie müssen den Anwendungsschlüssel angeben

# lblAADAppSecret.Help
source: A valid key for that Azure AD Application
de_de: Ein gültiger Schlüssel für diese Azure AD-Anwendung

# lblAADAppSecret.Text
source: Application Key
de_de: Anwendungsschlüssel

# lblAudiences.Help
source: Introduce the audiences to validate JWT tokens, separated by commas. If left empty, the B2C Application Id will be used by default.
de_de: Stellen Sie die Zielgruppen vor, um durch Kommas getrennte JWT-Token zu validieren. Wenn Sie dieses Feld leer lassen, wird standardmäßig die B2C-Anwendungs-ID verwendet.

# lblAudiences.Text
source: Audiences
de_de: Zielgruppen

# lblGraphClient.Help
source: If the sync is enabled, you need to specify an Azure App ID and secret to use the Microsoft Graph API.
de_de: Wenn die Synchronisierung aktiviert ist, müssen Sie eine Azure App-ID und ein Geheimnis angeben, um die Microsoft Graph-API zu verwenden.

# lblJwtAuthEnabled.Help
source: Enables JWT authorization for this portal
de_de: Aktiviert die JWT-Autorisierung für dieses Portal

# lblJwtAuthEnabled.Text
source: Enabled
de_de: Aktiviert

# lblProfileSyncEnabled.Help
source: Enables the profile synchronization for this portal
de_de: Aktiviert die Profilsynchronisierung für dieses Portal

# lblProfileSyncEnabled.Text
source: Profile Sync
de_de: Profilsynchronisierung

# lblRoleSyncEnabled.Help
source: Enables the role synchronization for this portal
de_de: Aktiviert die Rollensynchronisierung für dieses Portal

# lblRoleSyncEnabled.Text
source: Role Sync
de_de: Rollensynchronisation

# lblSynchronization.Text
source: Synchronization
de_de: Synchronisation

# lblSynchronizationDesc.Text
source: The synchronization process automatically syncs roles and profile from your Azure AD B2C tenant into your DNN portal when a user logins. This can affect login performance.
de_de: Der Synchronisierungsvorgang synchronisiert automatisch Rollen und Profile Ihres Azure AD B2C-Mandanten mit Ihrem DNN-Portal, wenn sich ein Benutzer anmeldet. Dies kann die Anmeldeleistung beeinträchtigen.

# lblTokenValidation.Help
source: This provider supports JWT authorization. If enabled, you can get a JWT token directly from the Azure AD B2C API, and then call a DNN WebAPI controller.
de_de: Dieser Anbieter unterstützt die JWT-Autorisierung. Wenn diese Option aktiviert ist, können Sie ein JWT-Token direkt von der Azure AD B2C-API abrufen und anschließend einen DNN-WebAPI-Controller aufrufen.controller.

# lblTokenValidation.Text
source: JWT Authorization
de_de: JWT-Autorisierung

# lblAPIResource.Text
source: API Resource
de_de: API-Ressource

# lblAPIResourceDesc.Text
source: If you are going to use the issued tokens to access an external WebAPI that uses B2C Authorization, you can specify the App ID URI and scopes that will be validated by the WebAPI
de_de: Wenn Sie die ausgestellten Token für den Zugriff auf eine externe Web-API verwenden, die die B2C-Autorisierung verwendet, können Sie den App-ID-URI und die Bereiche angeben, die von der Web-API validiert werden

# lblAppIdUri.Help
source: The App ID Uri of the external WebAPI, obtained from the Azure portal (i.e. https://mytenant.onmicrosoft.com/myapi/)
de_de: Die App-ID Uri der externen WebAPI, die vom Azure-Portal abgerufen wird (d. H. Https://mytenant.onmicrosoft.com/myapi/)

# lblScopes.Help
source: The scopes separated by spaces, that will be include in the issued tokens, to be validated by the external WebAPI (i.e. "read write")
de_de: Die durch Leerzeichen getrennten Bereiche, die in den ausgegebenen Token enthalten sein werden, werden von der externen WebAPI validiert (d. H. "read write").

# lblScopes.Text
source: Scopes
de_de: Bereiche

# lblUseGlobalSettings.Help
source: If enabled, all the settings are applied to all portals on this deployment. Only Super Users can edit this setting
de_de: Wenn diese Option aktiviert ist, werden alle Einstellungen auf alle Portale dieser Bereitstellung angewendet. Nur Superuser können diese Einstellung bearbeiten

# lblUseGlobalSettings.Text
source: Use Global Settings
de_de: Verwenden Sie die globalen Einstellungen

# lblRedirectUri.Help
source: If specified, the redirect uri after a successful login. By default (blank), the user will be redirected to the page originating the login redirection.
de_de: Falls angegeben, leitet die URI nach einer erfolgreichen Anmeldung weiter. Standardmäßig (leer) wird der Benutzer auf die Seite umgeleitet, von der die Anmeldeumleitung ausgeht.

# lblRedirectUri.Text
source: Redirect Uri
de_de: Leiten Sie Uri um

# B2cExtension.Header.Text
source: B2C Extension
de_de: B2C Erweiterung

# cmdAddProfileMapping.Text
source: Add Mapping
de_de: Zuordnung hinzufügen

# DnnProfileProperty.Header.Text
source: DNN Profile Property
de_de: DNN-Profileigenschaft

# lblProfilePropertiesMapping.Text
source: USER PROFILE PROPERTIES MAPPING
de_de: ZUORDNUNG VON BENUTZERPROFILEIGENSCHAFTEN

# InvalidB2cClaimName.Text
source: You have to type a valid B2C claim name
de_de: Sie müssen einen gültigen B2C-Anspruchsnamen eingeben.

# lblB2cExtensionName.Text
source: B2C Extension
de_de: B2C Erweiterung

# lblDnnProfilePropertyName.Text
source: DNN profile property
de_de: DNN-Profileigenschaft*

# ProfileMappingDeletedWarning.Text
source: Are you sure you want to delete this mapping?
de_de: Sind Sie sicher, dass Sie dieses Mapping löschen möchten?
